In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("movies.csv", sep=';')
data.head()

,release_date,title,length,score,sales,genre1,genre2,genre3,genre4,genre5,genre6,genre7
0,1916,Intolerance,11,74,8,Drama,0,0,0,0,0,0
1,1925,The Big Parade,14,70,22,Drama,Romance,War,0,0,0,0
2,1927,Metropolis,10,80,0,Drama,Science Fiction,0,0,0,0,0
3,1929,Pandora's Box,13,76,0,Drama,Thriller,Romance,0,0,0,0
4,1929,The Broadway Melody,19,50,4,Drama,Music,Romance,0,0,0,0

In [3]:
data = data[data["release_date"] >= 1985]
data.shape

(4393, 12)

In [4]:
data = data[data["sales"] > 0]
data = data[data["length"] > 0]
data.shape

(2885, 12)

In [5]:
data.drop(['genre2', 'genre3', 'genre4', 'genre5', 'genre6', 'genre7'], axis=1, inplace=True)

In [6]:
data.reset_index(inplace = True)
data.drop(['index'], axis=1,inplace= True)
data.head()

,release_date,title,length,score,sales,genre1
0,1985,Witness,7,70,68,Crime
1,1985,The Last Dragon,15,64,25,Action
2,1985,Friday the 13th: A New Beginning,32,51,21,Horror
3,1985,Ladyhawke,9,68,18,Adventure
4,1985,Red Sonja,9,50,6,Adventure

In [7]:
data.columns = ['year', 'title', 'length','score', 'sales', 'genre']
data.head()

   year                             title  length  score  sales      genre
0  1985                           Witness       7     70     68      Crime
1  1985                   The Last Dragon      15     64     25     Action
2  1985  Friday the 13th: A New Beginning      32     51     21     Horror
3  1985                         Ladyhawke       9     68     18  Adventure
4  1985                         Red Sonja       9     50      6  Adventure

In [8]:
data['genre'].value_counts()

Drama              639
Comedy             598
Action             542
Adventure          246
Horror             168
Crime              121
Thriller           115
Animation           96
Fantasy             88
Romance             66
Science Fiction     65
Family              36
Documentary         28
Mystery             26
War                 15
Music               15
History             13
Western              8
Name: genre, dtype: int64

In [9]:
data.loc[data['genre'] == 'War'] = "Action"

In [10]:
data.loc[data['genre'] == 'Western'] = "Action"

In [11]:
data.loc[data['genre'] == 'Animation'] = "Family"

In [12]:
data.loc[data['genre'] == 'Mystery'] = "Drama"

In [13]:
data.loc[data['genre'] == 'Music'] = "Drama"

In [14]:
data.loc[data['genre'] == 'Science Fiction'] = "Sci-Fi"

In [15]:
data['genre'].value_counts()

Drama          680
Comedy         598
Action         565
Adventure      246
Horror         168
Family         132
Crime          121
Thriller       115
Fantasy         88
Romance         66
Sci-Fi          65
Documentary     28
History         13
Name: genre, dtype: int64

In [16]:
data.shape

(2885, 6)

In [17]:
data.to_csv("movies_processed.csv", index=False)